tap "mike-engel/jwt-cli"
tap "sst/tap"
tap "thecasualcoder/stable"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-roboto-mono-nerd-font"

# Essential tools
brew "atuin"
brew "autossh"
brew "bat"
brew "curl"
brew "diff-so-fancy"
brew "difftastic"
brew "dive"
brew "dust"
brew "fd"
brew "fdupes"
brew "ffmpeg"
brew "fswatch"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-open"
brew "hexyl"
brew "htmlq" # pup alternative in rust
brew "htop"
brew "httpie"
brew "hyperfine" # Benchmarks
brew "jq"
brew "jwt-cli"
brew "k9s"
brew "make"
brew "mkcert"
brew "mosh"
brew "neovim"
brew "opencode"
brew "rclone"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "scrcpy"
brew "sesh"
brew "sops"
brew "speedtest-cli"
brew "ssh-copy-id", link: true
brew "starship"
brew "tailspin"
brew "tealdeer" # tldr alternative in rust
brew "tmux"
brew "tree"
brew "vivid"
brew "watch"
brew "wget"
brew "yq"
brew "zoxide"
brew "zsh"

# Languages
brew "go"
brew "n"
brew "uv"
brew "python@3.14"
brew "rustup"

# Caddy server
brew "caddy"

# Kubernetes
brew "helm@3"
brew "kubernetes-cli"
brew "kubectx"
brew "kube-fzf"

# Cloud CLI
# cask "google-cloud-sdk"
brew "awscli"
brew "docker-credential-helper-ecr"

# MacOSX specific utils
brew "ack"
brew "cmake"
brew "coreutils"
brew "findutils"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnupg"
brew "gnutls"
brew "gping"
brew "grep"
brew "moreutils"
brew "netcat"
brew "nmap"

# Apps
cask "brave-browser"
cask "chromium"
cask "cyberduck"
cask "docker-desktop"
cask "ghostty"
cask "google-chrome"
cask "hammerspoon"
cask "hiddenbar"
cask "keycastr"
cask "maccy"
cask "macdown"
cask "rectangle"
cask "runjs"
cask "spotify"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "whatsapp"
cask "zed"
cask "zen"

# Work apps & tools
# brew "gemini-cli"
# brew "snyk-cli"
# brew "teleport"
brew "argo"
brew "grype"
brew "helm-docs"
brew "jira-cli"
brew "p7zip"
brew "qpdf"
brew "sonar-scanner"
brew "trivy"
brew "websocat"
brew "yamllint"
cask "microsoft-remote-desktop"
cask "slack"
cask "zoom"

