tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# tap "hpedrorodrigues/tools"

# Essential tools
brew "autossh"
brew "bat"
# brew "ctop"
brew "curl"
brew "diff-so-fancy"
brew "dive"
brew "docker", link: false
brew "dust"
brew "exa"
brew "fd"
brew "fdupes"
brew "fswatch"
brew "fx"
brew "fzf"
brew "git-delta"
brew "git-flow"
brew "git"
brew "grpc"
brew "hey"
brew "htmlq" # pup alternative in rust
brew "htop"
brew "httpie"
brew "hyperfine"
brew "jq"
brew "make"
brew "mkcert"
brew "neovim"
brew "openssh"
brew "openssl@1.1"
brew "openssl@3"
brew "pup"
brew "rename"
brew "ripgrep"
brew "sops"
brew "speedtest-cli"
brew "starship"
brew "ssh-copy-id", link: true
brew "tealdeer" # tldr alternative in rust
brew "tig"
brew "tmux-xpanes"
brew "tmux"
brew "tree"
brew "vivid"
brew "watch"
brew "xsv"
brew "yq"
brew "zsh"
brew "zoxide"

# Languages
brew "go"
brew "n"
brew "pipenv"
brew "python@3.10"
brew "rustup"

# Caddy server
brew "caddy"

# Kubernetes
brew "helm"
brew "kubernetes-cli"
brew "kubectx"

# Cloud CLI
cask "google-cloud-sdk"
# brew "docker-credential-helper-ecr"

# MacOSX specific utils
brew "cmake"
brew "coreutils"
brew "findutils"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "gping"
brew "grep"
brew "moreutils"
brew "nmap"
brew "reattach-to-user-namespace"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack"
cask "font-meslo-lg-nerd-font"
cask "font-roboto-mono"

# Apps

# Work specific
cask "1password"
cask "authy"
cask "bitwarden"
cask "docker"
# cask "dockutil"
cask "firefox-developer-edition"
cask "fork"
cask "google-chrome"
cask "iterm2"
cask "keycastr"
cask "leapp"
cask "maccy"
cask "macdown"
cask "responsively"
cask "runjs"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "table-tool"
cask "tableplus"
cask "telegram"
cask "toggl-track"
cask "visual-studio-code"
cask "vlc"
cask "webtorrent"
cask "whatsapp"
cask "zoom"

# Other apps
# cask "android-file-transfer"
# cask "android-platform-tools"
cask "figma"
cask "transmission"

# Services
brew "postgresql@14", restart_service: true
brew "postgis"
brew "redis", restart_service: true
