tap "hidetatz/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "minacle/chntpw"
tap "nakabonne/ali"
tap "teamookla/speedtest"
brew "openssl@1.1"
brew "argon2"
brew "aria2"
brew "autossh"
brew "awscli"
brew "bash"
brew "bat"
brew "cabextract"
brew "caddy"
brew "python@3.9"
brew "ccze"
brew "cdrtools"
brew "cmake"
brew "curl"
brew "composer"
brew "coreutils"
brew "ctop"
brew "diff-so-fancy"
brew "dive"
brew "docker", link: false
brew "docker-credential-helper-ecr"
brew "dockutil"
brew "dust"
brew "exa"
brew "fd"
brew "fdupes"
brew "findutils"
brew "fswatch"
brew "fx"
brew "fzf"
brew "nss"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "git-flow"
brew "gitlab-runner"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "go"
brew "gping"
brew "grep"
brew "grpc"
brew "helm"
brew "hey"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "jsonnet"
brew "k3d"
brew "kubernetes-cli"
brew "kubectx"
brew "libtomcrypt"
brew "make"
brew "mcrypt"
brew "mitmproxy"
brew "mkcert"
brew "moreutils"
brew "mosh"
brew "n"
brew "neovim"
brew "nmap"
brew "openssh"
brew "openssl@3"
brew "php@7.4"
brew "pipenv"
brew "postgresql@14"
brew "postgis"
brew "pup"
brew "pure"
brew "python@3.8"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "rename"
brew "ripgrep"
brew "rust"
brew "sevenzip"
brew "sops"
brew "speedtest-cli", link: false
brew "ssh-copy-id", link: true
brew "subversion"
brew "tig"
brew "tilt"
brew "tldr"
brew "tmux"
brew "tmux-xpanes"
brew "tree"
brew "vivid"
brew "watch"
brew "wget"
brew "wimlib"
brew "xsv"
brew "yq"
brew "zsh"
brew "minacle/chntpw/chntpw"
brew "nakabonne/ali/ali"
brew "teamookla/speedtest/speedtest"
cask "1password"
cask "ace-link"
cask "android-file-transfer"
cask "android-platform-tools"
cask "angry-ip-scanner"
cask "authy"
cask "chromium"
cask "docker"
cask "figma"
cask "firefox-developer-edition"
cask "font-fira-code"
cask "font-hack"
cask "font-roboto-mono"
cask "fork"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "keycastr"
cask "leapp"
cask "maccy"
cask "macdown"
cask "ngrok"
cask "notion"
cask "nwjs"
cask "responsively"
cask "runjs"
cask "slack"
cask "soda-player"
cask "spectacle"
cask "spotify"
cask "sublime-text"
cask "table-tool"
cask "tableplus"
cask "telegram"
cask "toggl-track"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "webtorrent"
cask "whatsapp"
cask "zoom"
